OTHER-100/drift-flux-indoor-particles/code/openfoam/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Room dimensions: 0.8 x 0.4 x 0.4 m
// Inlet: 0.04 x 0.04 m, center at (0, 0.2, 0.36) -> y=[0.18,0.22], z=[0.34,0.38]
// Outlet: 0.04 x 0.04 m, center at (0.8, 0.2, 0.04) -> y=[0.18,0.22], z=[0.02,0.06]

// Grid: 40 x 20 x 20 cells
// To properly resolve inlet/outlet, we need block decomposition

// Strategy: decompose into blocks that align with inlet/outlet boundaries
// x: 0 -- 0.8 (40 cells)
// y: 0 -- 0.18 -- 0.22 -- 0.4 (9 + 2 + 9 = 20 cells)
// z: 0 -- 0.02 -- 0.06 -- 0.34 -- 0.38 -- 0.4 (1 + 2 + 14 + 2 + 1 = 20 cells)

scale 1.0;

vertices
(
    // z=0 plane
    // y=0 row
    (0    0    0)       // 0
    (0.8  0    0)       // 1
    // y=0.18 row
    (0    0.18 0)       // 2
    (0.8  0.18 0)       // 3
    // y=0.22 row
    (0    0.22 0)       // 4
    (0.8  0.22 0)       // 5
    // y=0.4 row
    (0    0.4  0)       // 6
    (0.8  0.4  0)       // 7

    // z=0.02 plane
    (0    0    0.02)    // 8
    (0.8  0    0.02)    // 9
    (0    0.18 0.02)    // 10
    (0.8  0.18 0.02)    // 11
    (0    0.22 0.02)    // 12
    (0.8  0.22 0.02)    // 13
    (0    0.4  0.02)    // 14
    (0.8  0.4  0.02)    // 15

    // z=0.06 plane
    (0    0    0.06)    // 16
    (0.8  0    0.06)    // 17
    (0    0.18 0.06)    // 18
    (0.8  0.18 0.06)    // 19
    (0    0.22 0.06)    // 20
    (0.8  0.22 0.06)    // 21
    (0    0.4  0.06)    // 22
    (0.8  0.4  0.06)    // 23

    // z=0.34 plane
    (0    0    0.34)    // 24
    (0.8  0    0.34)    // 25
    (0    0.18 0.34)    // 26
    (0.8  0.18 0.34)    // 27
    (0    0.22 0.34)    // 28
    (0.8  0.22 0.34)    // 29
    (0    0.4  0.34)    // 30
    (0.8  0.4  0.34)    // 31

    // z=0.38 plane
    (0    0    0.38)    // 32
    (0.8  0    0.38)    // 33
    (0    0.18 0.38)    // 34
    (0.8  0.18 0.38)    // 35
    (0    0.22 0.38)    // 36
    (0.8  0.22 0.38)    // 37
    (0    0.4  0.38)    // 38
    (0.8  0.4  0.38)    // 39

    // z=0.4 plane
    (0    0    0.4)     // 40
    (0.8  0    0.4)     // 41
    (0    0.18 0.4)     // 42
    (0.8  0.18 0.4)     // 43
    (0    0.22 0.4)     // 44
    (0.8  0.22 0.4)     // 45
    (0    0.4  0.4)     // 46
    (0.8  0.4  0.4)     // 47
);

// Cell counts for each segment to total 40x20x20
// x: 40 cells over 0.8m
// y: 9 cells (0-0.18) + 2 cells (0.18-0.22) + 9 cells (0.22-0.4) = 20
// z: 1 cell (0-0.02) + 2 cells (0.02-0.06) + 14 cells (0.06-0.34) + 2 cells (0.34-0.38) + 1 cell (0.38-0.4) = 20

blocks
(
    // Row z=0 to z=0.02 (1 cell in z)
    hex (0 1 3 2 8 9 11 10) (40 9 1) simpleGrading (1 1 1)       // y=0..0.18
    hex (2 3 5 4 10 11 13 12) (40 2 1) simpleGrading (1 1 1)     // y=0.18..0.22
    hex (4 5 7 6 12 13 15 14) (40 9 1) simpleGrading (1 1 1)     // y=0.22..0.4

    // Row z=0.02 to z=0.06 (2 cells in z)
    hex (8 9 11 10 16 17 19 18) (40 9 2) simpleGrading (1 1 1)
    hex (10 11 13 12 18 19 21 20) (40 2 2) simpleGrading (1 1 1)
    hex (12 13 15 14 20 21 23 22) (40 9 2) simpleGrading (1 1 1)

    // Row z=0.06 to z=0.34 (14 cells in z)
    hex (16 17 19 18 24 25 27 26) (40 9 14) simpleGrading (1 1 1)
    hex (18 19 21 20 26 27 29 28) (40 2 14) simpleGrading (1 1 1)
    hex (20 21 23 22 28 29 31 30) (40 9 14) simpleGrading (1 1 1)

    // Row z=0.34 to z=0.38 (2 cells in z)
    hex (24 25 27 26 32 33 35 34) (40 9 2) simpleGrading (1 1 1)
    hex (26 27 29 28 34 35 37 36) (40 2 2) simpleGrading (1 1 1)
    hex (28 29 31 30 36 37 39 38) (40 9 2) simpleGrading (1 1 1)

    // Row z=0.38 to z=0.4 (1 cell in z)
    hex (32 33 35 34 40 41 43 42) (40 9 1) simpleGrading (1 1 1)
    hex (34 35 37 36 42 43 45 44) (40 2 1) simpleGrading (1 1 1)
    hex (36 37 39 38 44 45 47 46) (40 9 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            // x=0 face of block with y=[0.18,0.22], z=[0.34,0.38]
            (26 28 36 34)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            // x=0.8 face of block with y=[0.18,0.22], z=[0.02,0.06]
            (11 13 21 19)
        );
    }

    walls
    {
        type wall;
        faces
        (
            // All remaining external faces are walls
            // x=0 face (front wall, minus inlet)
            (0 2 10 8)
            (2 4 12 10)
            (4 6 14 12)
            (8 10 18 16)
            (10 12 20 18)
            (12 14 22 20)
            (16 18 26 24)
            (18 20 28 26)
            (20 22 30 28)
            (24 26 34 32)
            // skip inlet: (26 28 36 34)
            (28 30 38 36)
            (32 34 42 40)
            (34 36 44 42)
            (36 38 46 44)

            // x=0.8 face (back wall, minus outlet)
            (1 3 11 9)
            (3 5 13 11)
            (5 7 15 13)
            (9 11 19 17)
            // skip outlet: (11 13 21 19)
            (13 15 23 21)
            (17 19 27 25)
            (19 21 29 27)
            (21 23 31 29)
            (25 27 35 33)
            (27 29 37 35)
            (29 31 39 37)
            (33 35 43 41)
            (35 37 45 43)
            (37 39 47 45)

            // y=0 face (side wall)
            (0 1 9 8)
            (8 9 17 16)
            (16 17 25 24)
            (24 25 33 32)
            (32 33 41 40)

            // y=0.4 face (side wall)
            (6 7 15 14)
            (14 15 23 22)
            (22 23 31 30)
            (30 31 39 38)
            (38 39 47 46)

            // z=0 face (floor)
            (0 1 3 2)
            (2 3 5 4)
            (4 5 7 6)

            // z=0.4 face (ceiling)
            (40 41 43 42)
            (42 43 45 44)
            (44 45 47 46)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
