OTHER-100/drift-flux-indoor-particles/code/openfoam/constant/momentumTransport
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      momentumTransport;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// RNG k-epsilon turbulence model (as specified in Chen et al. 2006)
// Coefficients from Speziale & Thangam (1992)

simulationType  RAS;

RAS
{
    model           RNGkEpsilon;

    turbulence      on;

    printCoeffs     on;

    // RNG k-epsilon coefficients (Speziale & Thangam 1992)
    // OpenFOAM's RNGkEpsilon uses these by default:
    // Cmu = 0.0845, C1 = 1.42, C2 = 1.68
    // sigmak = 0.7194, sigmaEps = 0.7194
    // eta0 = 4.38, beta = 0.012
}

// ************************************************************************* //
