OTHER-100/drift-flux-indoor-particles/code/openfoam/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Air at 20deg C, 1 atm
// rho = 1.205 kg/m3
// mu = 1.81e-5 Pa.s
// nu = mu/rho = 1.5e-5 m2/s

transportModel  Newtonian;

nu              1.5e-05;

// ************************************************************************* //
