OTHER-100/drift-flux-indoor-particles/code/openfoam/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Turbulent dissipation rate
// epsilon = Cmu^0.75 * k^1.5 / l
// Cmu = 0.0845, l = 0.07 * Dh (hydraulic diameter of inlet)
// Dh_inlet = 0.04 m, l = 0.07 * 0.04 = 0.0028 m
// For k = 1.9e-4: epsilon = 0.0845^0.75 * (1.9e-4)^1.5 / 0.0028
//   = 0.1233 * 8.28e-7 / 0.0028 = 3.65e-5 m2/s3
// Round to ~4e-5

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 4e-5;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 4e-5;       // Change for Case 2
    }

    outlet
    {
        type            zeroGradient;
    }

    walls
    {
        type            epsilonWallFunction;
        value           uniform 4e-5;
    }
}

// ************************************************************************* //
