OTHER-100/drift-flux-indoor-particles/code/openfoam/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Turbulent kinetic energy
// Inlet: k = 1.5 * (U * I)^2
// For U=0.225 m/s, I=5% (typical for indoor ventilation):
// k = 1.5 * (0.225 * 0.05)^2 = 1.9e-4 m2/s2
// For U=0.45 m/s: k = 1.5 * (0.45 * 0.05)^2 = 7.6e-4 m2/s2

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1.9e-4;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 1.9e-4;     // Change for Case 2: 7.6e-4
    }

    outlet
    {
        type            zeroGradient;
    }

    walls
    {
        type            kqRWallFunction;
        value           uniform 1.9e-4;
    }
}

// ************************************************************************* //
